DC1-Serv-1-VRF-A#sh ip int b
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0     unassigned      YES unset  up                    up      
GigabitEthernet0/1     unassigned      YES unset  up                    up      
GigabitEthernet0/2     unassigned      YES unset  administratively down down    
GigabitEthernet0/3     unassigned      YES unset  administratively down down    
Port-channel12         unassigned      YES unset  up                    up      
Vlan12                 12.1.1.1        YES NVRAM  administratively down down    
Vlan20                 192.168.20.2    YES manual administratively down down    
Vlan30                 192.168.30.2    YES manual up                    up      
DC1-Serv-1-VRF-A# ping 192.168.30.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.30.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 37/68/158 ms
DC1-Serv-1-VRF-A#ping 2.2.2.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 2.2.2.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 29/39/50 ms
DC1-Serv-1-VRF-A#ping 192.168.20.254
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.20.254, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 7/8/13 ms
DC1-Serv-1-VRF-A#


DC1-Serv-1-VRF-A#ping FC00:192:168:30::254
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to FC00:192:168:30::254, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 6/12/21 ms
DC1-Serv-1-VRF-A#ping FC00:192:168:20::254
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to FC00:192:168:20::254, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 5/8/16 ms
DC1-Serv-1-VRF-A#ping fc00:2:2:2::2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to FC00:2:2:2::2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 29/52/128 ms
DC1-Serv-1-VRF-A#

DC1-Serv-1-VRF-A#sh run int g0/0
Building configuration...

Current configuration : 132 bytes
!
interface GigabitEthernet0/0
 switchport trunk encapsulation dot1q
 switchport mode trunk
 media-type rj45
 negotiation auto
end
